
drop  table if exists sys_cw_km ;
create table sys_cw_km(
                        id bigint primary key auto_increment,
                        bm varchar(50) not null,
                        name varchar(100) not null,
                        c_kind varchar(20) not null,
                        c_use varchar(100) ,
                        fid bigint default 0
) ;
select * from sys_cw_km ;
insert into sys_cw_km (c_kind,bm,name,c_use) values
('资产类','1001','库存现金',''),('资产类','1431','周转材料','建造承包商专用'),('资产类','1002','银行存款',''),('资产类','1441','贵金属','银行专用'),('资产类','1003','存放中央银行款项','银行专用'),('资产类','1442','抵债资产','金融共用'),('资产类','1011','存放同业','银行专用'),('资产类','1451','损余物资','保险专用'),('资产类','1015','其它货币基金',''),('资产类','1461','存货跌价准备',''),('资产类','1021','结算备付金','证券专用'),('资产类','1501','待摊费用',''),('资产类','1031','存出保证金','金融共用'),('资产类','1511','独立帐户资产','保险专用'),('资产类','1051','拆出资金','金融共用'),('资产类','1521','持有至到期投资',''),('资产类','1101','交易性金融资产',''),('资产类','1522','持有至到期投资减值准备',''),('资产类','1111','买入返售金融资产','金融共用'),('资产类','1523','可供出售金融资产',''),('资产类','1121','应收票据',''),('资产类','1524','长期股权投资',''),('资产类','1122','应收帐款',''),('资产类','1525','长期股权投资减值准备',''),('资产类','1123','预付帐款',''),('资产类','1526','投资性房地产',''),('资产类','1131','应收股利',''),('资产类','1531','长期应收款',''),('资产类','1132','应收利息',''),('资产类','1541','未实现融资收益',''),('资产类','1211','应收保护储金','保险专用'),('资产类','1551','存出资本保证金','保险专用'),('资产类','1221','应收代位追偿款','保险专用'),('资产类','1601','固定资产',''),('资产类','1222','应收分保帐款','保险专用'),('资产类','1602','累计折旧',''),('资产类','1223','应收分保未到期责任准备金','保险专用'),('资产类','1603','固定资产减值准备',''),('资产类','1224','应收分保保险责任准备金','保险专用'),('资产类','1604','在建工程',''),('资产类','1231','其它应收款',''),('资产类','1605','工程物资',''),('资产类','1241','坏帐准备',''),('资产类','1606','固定资产清理',''),('资产类','1251','贴现资产','银行专用'),('资产类','1611','融资租赁资产','租赁专用'),('资产类','1301','贷款','银行和保险共用'),('资产类','1612','未担保余值','租赁专用'),('资产类','1302','贷款损失准备','银行和保险共用'),('资产类','1621','生产性生物资产','农业专用'),('资产类','1311','代理兑付证券','银行和保险共用'),('资产类','1622','生产性生物资产累计折旧','农业专用'),('资产类','1321','代理业务资产',''),('资产类','1623','公益性生物资产','农业专用'),('资产类','1401','材料采购',''),('资产类','1631','油气资产','石油天然气开采专用'),('资产类','1402','在途物资',''),('资产类','1632','累计折耗','石油天然气开采专用'),('资产类','1403','原材料',''),('资产类','1701','无形资产',''),('资产类','1404','材料成本差异',''),('资产类','1702','累计摊销',''),('资产类','1406','库存商品',''),('资产类','1703','无形资产减值准备',''),('资产类','1407','发出商品',''),('资产类','1711','商誉',''),('资产类','1410','商品进销差价',''),('资产类','1801','长期待摊费用',''),('资产类','1411','委托加工物资',''),('资产类','1811','递延所得资产',''),('资产类','1412','包装物及低值易耗品',''),('资产类','1901','待处理财产损益',''),('资产类','1421','消耗性物物资产','农业专用'),
('负债类','2001','短期借款',''),('负债类','2261','应付分保帐款','保险专用'),('负债类','2002','存入保证金','金融共用'),('负债类','2311','代理买卖证券款','证券专用'),('负债类','2003','拆入资金','金融共用'),('负债类','2312','代理承销证券款','证券和银行共用'),('负债类','2004','向中央银行借款','银行专用'),('负债类','2313','代理兑付证券款','证券和银行共用'),('负债类','2011','同业存放','银行专用'),('负债类','2314','代理业务负债',''),('负债类','2012','吸收存款','银行专用'),('负债类','2401','预提费用',''),('负债类','2021','贴现负债','银行专用'),('负债类','2411','预计负债',''),('负债类','2101','交易性金融负债',''),('负债类','2501','递延收益',''),('负债类','2111','专出回购金融资产款','金融共用'),('负债类','2601','长期借款',''),('负债类','2201','应付票据',''),('负债类','2602','长期债券',''),('负债类','2202','应付帐款',''),('负债类','2701','未到期责任准备金','保险专用'),('负债类','2205','预收帐款',''),('负债类','2702','保险责任准备金','保险专用'),('负债类','2211','应付职工薪酬',''),('负债类','2711','保户储金','保险专用'),('负债类','2221','应交税费',''),('负债类','2721','独立帐户负债','保险专用'),('负债类','2231','应付股利',''),('负债类','2801','长期应付款',''),('负债类','2232','应付利息',''),('负债类','2802','未确认融资费用',''),('负债类','2241','其他应付款',''),('负债类','2811','专项应付款',''),('负债类','2251','应付保户红利','保险专用'),('负债类','2901','递延所得税负债',''),
('共同类','3001','清算资金往来','银行专用'),('共同类','3201','套期工具',''),('共同类','3002','外汇买卖','金融共用'),('共同类','3202','被套期项目',''),('共同类','3101','衍生工具',''),
('所有者权益类','4001','实收资本',''),('所有者权益类','4103','本年利润',''),('所有者权益类','4002','资本公积',''),('所有者权益类','4104','利润分配',''),('所有者权益类','4101','盈余公积',''),('所有者权益类','4201','库存股',''),('所有者权益类','4102','一般风险准备','金融共用'),
('成本类','5001','生产成本',''),('成本类','5401','工程施工','建造承包商专用'),('成本类','5101','制造费用',''),('成本类','5402','工程结算','建造承包商专用'),('成本类','5201','劳务成本',''),('成本类','5403','机械作业','建造承包商专用'),('成本类','5301','研发支出',''),
('损益类','6001','主营业务收入',''),('损益类','6411','利息支出','金融共用'),('损益类','6011','利息收入','金融共用'),('损益类','6421','手续费支出','金融共用'),('损益类','6021','手续费收入','金融共用'),('损益类','6501','提取未到期责任准备金','保险专用'),('损益类','6031','保费收入','保险专用'),('损益类','6502','撮保险责任准备金','保险专用'),('损益类','6032','分保费收入','保险专用'),('损益类','6511','赔付支出','保险专用'),('损益类','6041','租赁收入','租赁专用'),('损益类','6521','保户红利支出','保险专用'),('损益类','6051','其他业务收入',''),('损益类','6531','退保金','保险专用'),('损益类','6061','汇兑损益','金融专用'),('损益类','6541','分出保费','保险专用'),('损益类','6101','公允价值变动损益',''),('损益类','6542','分保费用','保险专用'),('损益类','6111','投资收益',''),('损益类','6601','销售费用',''),('损益类','6201','摊回保险责任准备金','保险专用'),('损益类','6602','管理费用',''),('损益类','6202','摊回赔付支出','保险专用'),('损益类','6603','财务费用',''),('损益类','6203','摊回分保费用','保险专用'),('损益类','6604','勘探费用',''),('损益类','6301','营业外收入',''),('损益类','6701','资产减值损失',''),('损益类','6401','主营业务成本',''),('损益类','6711','营业外支出',''),('损益类','6402','其它业务成本',''),('损益类','6801','所得税',''),('损益类','6405','营业税金及附加',''),('损益类','6901','以前年度损益调整','') ;


select * from sys_cw_km ;
drop table if exists cw_km ;
create table cw_km (
  select * from sys_cw_km
)
;
select * from cw_km ;
alter table cw_km change id id bigint primary key auto_increment ;
create index idx_cw_km_fid on cw_km (fid) ;
create index idx_cw_km_kind on cw_km(c_kind) ;

select count(c_kind) as cnt,c_kind from cw_km group by c_kind order by cnt desc ;









